bouffalolab/bl_iot_sdk/components/platform/hosal/bl808_hal/bl_sdh.h
#define SD_CMD_ERASE                               ((uint8_t)38)
#define SD_CMD_FAST_IO                             ((uint8_t)39) /*!< SD Card doesn't support it */
#define SD_CMD_GO_IRQ_STATE                        ((uint8_t)40) /*!< SD Card doesn't support it */
#define SD_CMD_LOCK_UNLOCK                         ((uint8_t)42)
#define SD_CMD_APP_CMD                             ((uint8_t)55)
#define SD_CMD_GEN_CMD                             ((uint8_t)56)
#define SD_CMD_NO_CMD                              ((uint8_t)64)

/** 
  * @brief Following commands are SD Card Specific commands.
  *        SDIO_APP_CMD :CMD55 should be sent before sending these commands. 
  */
#define SD_CMD_APP_SD_SET_BUSWIDTH                 ((uint8_t)6)  /*!< For SD Card only */
#define SD_CMD_SD_APP_STAUS                        ((uint8_t)13) /*!< For SD Card only */
#define SD_CMD_SD_APP_SEND_NUM_WRITE_BLOCKS        ((uint8_t)22) /*!< For SD Card only */
#define SD_CMD_SD_APP_OP_COND                      ((uint8_t)41) /*!< For SD Card only */
#define SD_CMD_SD_APP_SET_CLR_CARD_DETECT          ((uint8_t)42) /*!< For SD Card only */
#define SD_CMD_SD_APP_SEND_SCR                     ((uint8_t)51) /*!< For SD Card only */
#define SD_CMD_SDIO_RW_DIRECT                      ((uint8_t)52) /*!< For SD I/O Card only */
#define SD_CMD_SDIO_RW_EXTENDED                    ((uint8_t)53) /*!< For SD I/O Card only */

/** 
  * @brief Following commands are SD Card Specific security commands.
  *        SDIO_APP_CMD should be sent before sending these commands. 
  */
#define SD_CMD_SD_APP_GET_MKB                      ((uint8_t)43) /*!< For SD Card only */
#define SD_CMD_SD_APP_GET_MID                      ((uint8_t)44) /*!< For SD Card only */
#define SD_CMD_SD_APP_SET_CER_RN1                  ((uint8_t)45) /*!< For SD Card only */
#define SD_CMD_SD_APP_GET_CER_RN2                  ((uint8_t)46) /*!< For SD Card only */
#define SD_CMD_SD_APP_SET_CER_RES2                 ((uint8_t)47) /*!< For SD Card only */
#define SD_CMD_SD_APP_GET_CER_RES1                 ((uint8_t)48) /*!< For SD Card only */
#define SD_CMD_SD_APP_SECURE_READ_MULTIPLE_BLOCK   ((uint8_t)18) /*!< For SD Card only */
#define SD_CMD_SD_APP_SECURE_WRITE_MULTIPLE_BLOCK  ((uint8_t)25) /*!< For SD Card only */
#define SD_CMD_SD_APP_SECURE_ERASE                 ((uint8_t)38) /*!< For SD Card only */
#define SD_CMD_SD_APP_CHANGE_SECURE_AREA           ((uint8_t)49) /*!< For SD Card only */
#define SD_CMD_SD_APP_SECURE_WRITE_MKB             ((uint8_t)48) /*!< For SD Card only */


/** 
  * @brief  Mask for errors Card Status R1 (CSR Register) 
  */
#define SD_CSR_ADDR_OUT_OF_RANGE        ((uint32_t)0x80000000)
#define SD_CSR_ADDR_MISALIGNED          ((uint32_t)0x40000000)
#define SD_CSR_BLOCK_LEN_ERR            ((uint32_t)0x20000000)
#define SD_CSR_ERASE_SEQ_ERR            ((uint32_t)0x10000000)
#define SD_CSR_BAD_ERASE_PARAM          ((uint32_t)0x08000000)
#define SD_CSR_WRITE_PROT_VIOLATION     ((uint32_t)0x04000000)
#define SD_CSR_LOCK_UNLOCK_FAILED       ((uint32_t)0x01000000)
#define SD_CSR_COM_CRC_FAILED           ((uint32_t)0x00800000)
#define SD_CSR_ILLEGAL_CMD              ((uint32_t)0x00400000)
#define SD_CSR_CARD_ECC_FAILED          ((uint32_t)0x00200000)
#define SD_CSR_CC_ERROR                 ((uint32_t)0x00100000)
#define SD_CSR_GENERAL_UNKNOWN_ERROR    ((uint32_t)0x00080000)
#define SD_CSR_STREAM_READ_UNDERRUN     ((uint32_t)0x00040000)
#define SD_CSR_STREAM_WRITE_OVERRUN     ((uint32_t)0x00020000)
#define SD_CSR_CID_CSD_OVERWRIETE       ((uint32_t)0x00010000)
#define SD_CSR_WP_ERASE_SKIP            ((uint32_t)0x00008000)
#define SD_CSR_CARD_ECC_DISABLED        ((uint32_t)0x00004000)
#define SD_CSR_ERASE_RESET              ((uint32_t)0x00002000)
#define SD_CSR_AKE_SEQ_ERROR            ((uint32_t)0x00000008)
#define SD_CSR_ERRORBITS                ((uint32_t)0xFDFFE008)


#define SD_MAX_VOLT_TRIAL               ((uint32_t)0x0000FFFF)
#define SD_ALLZERO                      ((uint32_t)0x00000000)

#define SD_WIDE_BUS_SUPPORT             ((uint32_t)0x00040000)
#define SD_SINGLE_BUS_SUPPORT           ((uint32_t)0x00010000)
#define SD_CARD_LOCKED                  ((uint32_t)0x02000000)

#define SD_0TO7BITS                     ((uint32_t)0x000000FF)
#define SD_8TO15BITS                    ((uint32_t)0x0000FF00)
#define SD_16TO23BITS                   ((uint32_t)0x00FF0000)
#define SD_24TO31BITS                   ((uint32_t)0xFF000000)
#define SD_MAX_DATA_LENGTH              ((uint32_t)0x01FFFFFF)
/** 
  * @brief  Masks for R7 Response 
  */
#define SD_VOLTAGE_WINDOW_SD            ((uint32_t)0x00100000)
#define SD_HIGH_CAPACITY                ((uint32_t)0x40000000)
#define SD_STD_CAPACITY                 ((uint32_t)0x00000000)
#define SD_CHECK_PATTERN                ((uint32_t)0x000001AA)


/** 
  * @brief Supported SD Memory Cards 
  */
#define SDIO_STD_CAPACITY_SD_CARD_V1_1             ((uint32_t)0x00000000)
#define SDIO_STD_CAPACITY_SD_CARD_V2_0             ((uint32_t)0x00000001)
#define SDIO_HIGH_CAPACITY_SD_CARD                 ((uint32_t)0x00000002)
#define SDIO_MULTIMEDIA_CARD                       ((uint32_t)0x00000003)
#define SDIO_SECURE_DIGITAL_IO_CARD                ((uint32_t)0x00000004)
#define SDIO_HIGH_SPEED_MULTIMEDIA_CARD            ((uint32_t)0x00000005)
#define SDIO_SECURE_DIGITAL_IO_COMBO_CARD          ((uint32_t)0x00000006)
#define SDIO_HIGH_CAPACITY_MMC_CARD                ((uint32_t)0x00000007)


/*! @brief SD group number */
typedef enum _sd_group_num
{
    SDH_GroupTimingMode = 0U,     /*!< acess mode group*/
    SDH_GroupCommandSystem = 1U,  /*!< command system group*/
    SDH_GroupDriverStrength = 2U, /*!< driver strength group*/
    SDH_GroupCurrentLimit = 3U,   /*!< current limit group*/
} sd_group_num;

/*! @brief SD card timing mode flags */
typedef enum _sd_timing_mode
{
    SDH_TimingSDR12DefaultMode = 0U,   /*!< Identification mode & SDR12 */
    SDH_TimingSDR25HighSpeedMode = 1U, /*!< High speed mode & SDR25 */
    SDH_TimingSDR50Mode = 2U,          /*!< SDR50 mode*/
    SDH_TimingSDR104Mode = 3U,         /*!< SDR104 mode */
    SDH_TimingDDR50Mode = 4U,          /*!< DDR50 mode */
} sd_timing_mode_t;

/*! @brief SD card switch mode */
typedef enum _sd_switch_mode
{
    SDH_SwitchCheck = 0U, /*!< SD switch mode 0: check function */
    SDH_SwitchSet = 1U,   /*!< SD switch mode 1: set function */
} sd_switch_mode_t;

#define SDH_MSG(a,...)              bflb_platform_printf(a,##__VA_ARGS__)

/*
bus_wide shoud be SDH_DATA_BUS_WIDTH_1BIT/SDH_DATA_BUS_WIDTH_4BITS/SDH_DATA_BUS_WIDTH_8BITS
*/
SD_Error SDH_Init(uint32_t bus_wide,sd_card_t *pOutCardInfo);
SD_Error SD_Erase(uint32_t startaddr, uint32_t endaddr);
SD_Error SDH_BlockReadMultiBlocks(uint8_t *readbuff, uint32_t ReadAddr, uint16_t BlockSize, uint32_t NumberOfBlocks);
SD_Error SDH_BlockWriteMultiBlocks(uint8_t *writebuff, uint32_t WriteAddr, uint16_t BlockSize, uint32_t NumberOfBlocks);
SD_Error SDH_ReadMultiBlocks(uint8_t *readbuff, uint32_t ReadAddr, uint16_t BlockSize, uint32_t NumberOfBlocks);
SD_Error SDH_WriteMultiBlocks(uint8_t *writebuff, uint32_t WriteAddr, uint16_t BlockSize, uint32_t NumberOfBlocks);
#endif /* __SDCARD_H */

